//--------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------
/*
 * 
 *
 * Created: 
 *  Author: 
 */ 
//--------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------

#include "my_lib\adc.h"

//-----------------------------------------------------------------------------
static volatile uint8_t		AdcMeasureCounters = 0;//счетчик измерений.
static volatile uint16_t	AdcResult = 0;		   //Результат измерения. 
//-----------------------------------------------------------------------------
void adc_init(void){
	
	ADCSRA |= (1<<ADEN) |						// Разрешение использования АЦП.
			  (1<<ADPS2)|(1<<ADPS1)|(1<<ADPS0);	//Делитель 128 = 125 кГц.
}
//-----------------------------------------------------------------------------
uint16_t get_adc_measure(uint8_t chanel){
	
	//-----------------------------------
	//Выбор канала и источника опорного напряжения.
	chanel |= (1<<REFS0);//ИОН: AVCC with external capacitor at AREF pin.
	ADMUX  = chanel;
	//-----------------------------------
	AdcMeasureCounters = ADC_QUANTITY;  //
	AdcResult = 0;					    //Очистка регистра результата.
	ADCSRA |= (1<<ADIE);				//Разрешение прерывания от АЦП
	ADCSRA |= (1<<ADSC);				//Запуск преобразования АЦП.
	while(AdcMeasureCounters){};		//Ожидание окончания измерения и усреднения.
	return AdcResult;	
	//-----------------------------------
}
//-----------------------------------------------------------------------------
ISR(ADC_vect){
	
	//-----------------------------------
	AdcResult += ADCW;
	if (!(--AdcMeasureCounters))
		{
			ADCSRA &= ~(1<<ADIE);			//Запрет прерывания от АЦП
			AdcResult = (AdcResult >> 4);	//Усреднение по 16-ми измерениям, т.к. применяется передискретизация
											//для увеличения разрешающей способность до 12 бит.
		}
	else
		{
			ADCSRA |= (1<<ADSC);			//Запуск преобразования АЦП.
		}
	//-----------------------------------
}
//--------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------






