//--------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------
/*
 * 
 *
 * Created: 27.04.2018 
 *  Author: 
 */ 
//--------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------
#ifndef _CHARGE_H        // Блокировка повторного включение модуля.
#define _CHARGE_H 
//-----------------------------------------------------------------------------
//#define F_CPU 16000000UL //Частота кварца.

#include <avr/io.h>
//#include <util/delay.h>
//#include <avr/interrupt.h>

#include "my_lib/adc.h"
#include "my_lib/timers.h"
#include "my_lib/pt6964.h"
//-----------------------------------------------------------------------------
//Управление зарядом АКБ.
#define CHARGE_PORT	PORTA
#define CHARGE_DDR	DDRA
#define CHARGE_PIN	PINA
#define CHARGE_LEG	(1<<5)
//Мониторинг сетевого напряжения.
#define POWER220_PORT	PORTC
#define POWER220_DDR	DDRC
#define POWER220_PIN	PINC
#define POWER220_LEG	(1<<4)

#define CHARGE_ON	(CHARGE_PORT &= ~CHARGE_LEG)
#define CHARGE_OFF	(CHARGE_PORT |=  CHARGE_LEG)
//Коэффициент деления резистивного делителя.
//Верхний резистор 100кОм, нижний - 10КОм.
#define K_res_dev	11U
//#define VrefADC		2486U	//Опорное напряжение АПЦ в мВ.

//Уровни напряжений. Для 12 бит АЦП.
#define INPUT24V_SHORT		50U		//КЗ на клеммах.
#define INPUT24V_BREAK		2000U	//2В - обрыв соединительных проводов
									//или ко входу ничего не подключено.								 
#define INPUT24V_MIN		18000U	//18 В	- минимальное напряжение на АКБ.

#define INPUT24V_ALARM		19500U	//19,5 В - напряжение срабатывания системы контроля.
#define INPUT24V_ALARM_OFF	20500U	//20,5 В - напряжение при котором отключится тревога.
									//Это для обеспечения гестирезиса отключения тревоги.						 
#define INPUT24V_MAX		27000U	//27 В - максимальное напряжение на полностью заряженном АКБ,
									//оно же максимальное напряжение ЗУ.
//Индикация состояния блока заряда.
#define INPUT24V_INDICATE_ALARM		0xAF //Индикация "НА".
#define POWER220_INDICATE_ALARM		0xAE //Индикация "НП".

//Отладочная индикация.
#define INPUT24V_INDICATE_SHORT				0xA0
#define INPUT24V_INDICATE_BREAK				0xA1
#define INPUT24V_INDICATE_DEEP_DISCHARGE	0xA2
#define INPUT24V_INDICATE_NORM				0xA3
#define INPUT24V_INDICATE_MAX				0xA4
//-----------------------------------------------------------------------------
//extern volatile uint16_t	AdcResult;
//-----------------------------------------------------------------------------
//Прототипы функций.
void charge_init(void);
uint8_t get_charge_indication(void);
void set_charge_indication(uint8_t byte);
void clear_charge_indication(void);
void charge_monitoring_on(void);
//-----------------------------------------------------------------------------
#endif   // Закрывающий #endif к блокировке повторного включения
//--------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------

