/*
 * main.h
 *
 * Created: 13.12.2021 14:07:19
 *  Author: belyaev
 */ 
//#ifndef MAIN_H_
//#define MAIN_H_
#pragma once //Ёто замена дл€ include guard, встретив в заголовке эту директиву, препроцессор предотвратит повторное включение этого заголовка в обрабатываемую единицу трансл€ции.
//*******************************************************************************************
//*******************************************************************************************

#define F_CPU 16000000UL //„астота кварца.

#include <avr/io.h>    //
#include <util/delay.h>//
#include <avr/wdt.h>   //подключаем библиотеку дл€ работы со сторожевым

//*************************************************************
#include "atmegaconfig.h"

//#include "util/timerManager.h"
//#include "communication/i2cdispatcher.h"
//#include "power/powermanager.h"
//#include "util/tempsensormanager.h"

//#include "peripherals/tmc2130interfaceimpl.h"
//#include "communication/commandreceiver_i2c.h"
//#include "Mcu.h"
//*******************************************************************************************
//*******************************************************************************************

//*******************************************************************************************
//*******************************************************************************************
//#endif /* MAIN_H_ */

